[
  "I wondered why the baseball was getting bigger. Then it hit me.",
  "Did you hear about the guy whose whole left side was cut off? He's all right now.",
  "I wasn't originally going to get a brain transplant, but then I changed my mind.",
  "A friend of mine tried to annoy me with bird puns, but I soon realized that toucan play at that game.",
  "I'd tell you a chemistry joke but I know I wouldn't get a reaction.",
  "I'm reading a book about anti-gravity. It's impossible to put down.",
  "Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink.",
  "Yesterday I accidentally swallowed some food coloring. The doctor says I'm OK, but I feel like I've dyed a little inside.",
  "Have you ever tried to eat a clock? It's very time consuming.",
  "It's not that the man did not know how to juggle, he just didn't have the balls to do it.",
  "I heard a cheese pun the other day. It really haloumi away!",
  "I got a job maintaining elevators. It has its ups and downs.",
  "I hear that research into water purification is going down well.",
  "I can't believe I got fired from the calendar factory. All I did was take a day off.",
  "Why was Cinderella thrown off the basketball team? She ran away from the ball.",
  "I'm glad I know sign language, it's pretty handy.",
  "I wanna make a joke about sodium, but Na..",
  "What's the worst thing about throwing a party in space? You have to planet.",
  "Yesterday a clown held the door open for me. I thought it was a nice jester.",
  "I went to a really emotional wedding the other day. Even the cake was in tiers.",
  "Why didn't the lifeguard save the hippie? Because he was too far out, man.",
  "Fishermen are reel men",
  "What if there were no hypothetical questions?",
  "*For Sale:* Parachute. Only used once, never opened.",
  "Raisins are old-fashioned; I prefer something more currant.",
  "I used to go fishing with Skrillex. But he kept dropping the bass",
  "I ate too much Middle Eastern food. Now I falafel",
  "How do you make antifreeze? Steal her blanket",
  "There was an explosion at a cheese factory in France. There was de-brie everywhere",
  "Why couldn't the bicycle stand up on its own? It was two tired",
  "Did you hear about the guy who jumped off a bridge in Paris? He was in Seine",
  "I asked a Frenchman if he played video games. He said Wii",
  "Did you hear the joke about the german sausage? It was the wurst",
  "What do you do when chemists die? You barium",
  "The furniture store kept calling me to come back. But all I wanted was one night stand",
  "How did I escape Iraq? Iran"
]
